results/nv_vllm_FP8.txt
============ Serving Benchmark Result ============
Successful requests:                     30        
Failed requests:                         0         
Maximum request concurrency:             20        
Benchmark duration (s):                  146.69    
Total input tokens:                      97924     
Total generated tokens:                  7680      
Request throughput (req/s):              0.20      
Output token throughput (tok/s):         52.36     
Peak output token throughput (tok/s):    200.00    
Peak concurrent requests:                24.00     
Total token throughput (tok/s):          719.92    
---------------Time to First Token----------------
Mean TTFT (ms):                          27347.98  
Median TTFT (ms):                        19169.35  
P99 TTFT (ms):                           61029.06  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          240.73    
Median TPOT (ms):                        282.40    
P99 TPOT (ms):                           328.67    
---------------Inter-token Latency----------------
Mean ITL (ms):                           239.88    
Median ITL (ms):                         122.26    
P99 ITL (ms):                            3106.51   
==================================================