results/official_vllm_FP8c20.txt
============ Serving Benchmark Result ============
Successful requests:                     30        
Failed requests:                         0         
Maximum request concurrency:             20        
Benchmark duration (s):                  119.82    
Total input tokens:                      97924     
Total generated tokens:                  7680      
Request throughput (req/s):              0.25      
Output token throughput (tok/s):         64.10     
Peak output token throughput (tok/s):    240.00    
Peak concurrent requests:                22.00     
Total token throughput (tok/s):          881.36    
---------------Time to First Token----------------
Mean TTFT (ms):                          16279.92  
Median TTFT (ms):                        11130.53  
P99 TTFT (ms):                           41958.57  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          216.03    
Median TPOT (ms):                        239.96    
P99 TPOT (ms):                           275.77    
---------------Inter-token Latency----------------
Mean ITL (ms):                           215.27    
Median ITL (ms):                         101.95    
P99 ITL (ms):                            2031.95   
==================================================