results/official_vllm_NVFP4c4.txt
============ Serving Benchmark Result ============
Successful requests:                     30        
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  180.90    
Total input tokens:                      97924     
Total generated tokens:                  7680      
Request throughput (req/s):              0.17      
Output token throughput (tok/s):         42.45     
Peak output token throughput (tok/s):    80.00     
Peak concurrent requests:                8.00      
Total token throughput (tok/s):          583.76    
---------------Time to First Token----------------
Mean TTFT (ms):                          6412.74   
Median TTFT (ms):                        7010.17   
P99 TTFT (ms):                           9825.55   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          65.02     
Median TPOT (ms):                        63.56     
P99 TPOT (ms):                           81.39     
---------------Inter-token Latency----------------
Mean ITL (ms):                           64.79     
Median ITL (ms):                         54.67     
P99 ITL (ms):                            65.09     
==================================================