results/official_vllm_NVFP4c8.txt
============ Serving Benchmark Result ============
Successful requests:                     30        
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  138.84    
Total input tokens:                      97924     
Total generated tokens:                  7680      
Request throughput (req/s):              0.22      
Output token throughput (tok/s):         55.32     
Peak output token throughput (tok/s):    128.00    
Peak concurrent requests:                13.00     
Total token throughput (tok/s):          760.64    
---------------Time to First Token----------------
Mean TTFT (ms):                          9790.24   
Median TTFT (ms):                        9970.29   
P99 TTFT (ms):                           18480.67  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          98.43     
Median TPOT (ms):                        93.76     
P99 TPOT (ms):                           128.99    
---------------Inter-token Latency----------------
Mean ITL (ms):                           98.05     
Median ITL (ms):                         67.36     
P99 ITL (ms):                            1897.58   
==================================================